Revit 2024 API
BuiltInFailures.ElectricalFailures.InvalidApparentPowerDensity Property
 The Apparent Power Density is invalid. Edit the Power Density and/or Power Factor to recalculate the Apparent Power Density.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId InvalidApparentPowerDensity { get; }
Visual Basic
Public Shared ReadOnly Property InvalidApparentPowerDensity As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ InvalidApparentPowerDensity {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace